/**
 * 用零宽断言功能为数值添加千分符
 */

 // 为纯整数中的数字添加千分位
// 一个数字后面,紧跟着的数字字符个数为三的倍数时 , 将数字替换为 $1,
// 1,111111
console.log('123456789'.replace(/(\d)(?=(\d{3})+$)/g, '$1,'))
console.log('12345678'.replace(/(\d)(?=(\d{3})+$)/g, '$1,'))
console.log('123456'.replace(/(\d)(?=(\d{3})+$)/g, '$1,'))
console.log('123'.replace(/(\d)(?=(\d{3})+$)/g, '$1,'))

// 为文本中的整数字添加千分位
// 一个数字后面,紧跟着的数字字符个数为三的倍数时 , 并且截止于数字 ( ?!\d --> 当前位置的右边不是数字 )
console.log('The population of 12345678AAAA is growing 123123.'.replace(/(\d)(?=(\d{3})+(?!\d))/g,'$1,'))